# -*- coding: utf-8 -*-
"""
@Auth :YuanHan Zheng
"""
employee_infor = {
    '王力鸿': {'部门': '科技部',
            '工资': 3000,
            '级别': 1},
    '周杰轮': {'部门': '市场部',
            '工资': 5000,
            '级别': 2},
    '林俊节': {'部门': '市场部',
            '工资': 6000,
            '级别': 3},
    '张学油': {'部门': '科技部',
            '工资': 4000,
            '级别': 1},
    '刘德滑': {'部门': '市场部',
            '工资': 6000,
            '级别': 2}
}
print("全体员工当前信息如下：\n", employee_infor)

for name, info in employee_infor.items():
    if info['级别'] == 1:
        info['级别'] += 1
        info['工资'] += 1000

print("全体员工级别为 1 的员工完成升值加薪操作后：\n", employee_infor)
